Revit 2027 API
Categories.ForwardIterator Method
Retrieves a forward moving iterator to the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override CategoryNameMapIterator ForwardIterator()
Public Overrides Function ForwardIterator As CategoryNameMapIterator
public:
virtual CategoryNameMapIterator^ ForwardIterator() override
abstract ForwardIterator : unit -> CategoryNameMapIterator
override ForwardIterator : unit -> CategoryNameMapIterator
Return Value
CategoryNameMapIterator
A forward moving iterator to the map.
See Also
Reference
Categories Class
Autodesk.Revit.DB Namespace